# This will be the Jupyter Notebook Answer Sheet for this project.

In [16]:
import pandas as pd
import sqlite3
con = sqlite3.connect('sqlite_db_pythonsqlite.db')
cur = con.cursor()

Q1: Some of the facilities charge a fee to members, but some do not.
Write a SQL query to produce a list of the names of the facilities that do.

A1: <br>

><code>SELECT name <br>
>FROM Facilities <br>
>WHERE membercost > 0; </code>

In [17]:
# Using only sqlite3.
cur.execute('SELECT name FROM Facilities WHERE membercost > 0')
no_fee_fac = cur.fetchall()
for fac in no_fee_fac:
    print(fac)

('Tennis Court 1',)
('Tennis Court 2',)
('Massage Room 1',)
('Massage Room 2',)
('Squash Court',)

In [18]:
# Using sqlite3 and pandas.
no_fee_df = pd.read_sql_query('SELECT name FROM Facilities WHERE membercost > 0', con)
no_fee_df

             name
0  Tennis Court 1
1  Tennis Court 2
2  Massage Room 1
3  Massage Room 2
4    Squash Court

Q2: How many facilities do not charge a fee to members?

A2: <br>

><code>SELECT COUNT(name) AS num_no_fee <br>
>FROM Facilities <br>
>WHERE membercost = 0; </code>

In [19]:
# Using only sqlite3.
cur.execute('SELECT COUNT(name) as num_no_fee FROM Facilities WHERE membercost = 0')
no_fee_count = cur.fetchall()
for fac in no_fee_count:
    print(fac)

(4,)

In [20]:
# Using sqlite3 and pandas.
no_fee_df = pd.read_sql_query('SELECT COUNT(name) AS num_no_fee FROM Facilities WHERE membercost = 0', con)
no_fee_df

   num_no_fee
0           4

Q3: Write an SQL query to show a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost.
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question.

A3:<br>

><code>SELECT facid, name, membercost, monthlymaintenance <br>
>FROM Facilities<br>
>WHERE membercost > 0<br>
>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;AND membercost < (monthlymaintenance * 0.2); </code>

In [23]:
# Using only sqlite3.
cur.execute('SELECT facid, name, membercost, monthlymaintenance FROM Facilities WHERE membercost > 0 AND membercost < (monthlymaintenance * 0.2)')
query3 = cur.fetchall()
for fac in query3:
    print(fac)

(0, 'Tennis Court 1', 5, 200)
(1, 'Tennis Court 2', 5, 200)
(4, 'Massage Room 1', 9.9, 3000)
(5, 'Massage Room 2', 9.9, 3000)
(6, 'Squash Court', 3.5, 80)

In [24]:
# Using sqlite3 and pandas.
query3df = pd.read_sql_query('SELECT facid, name, membercost, monthlymaintenance FROM Facilities WHERE membercost > 0 AND membercost < (monthlymaintenance * 0.2)', con)
query3df

   facid            name  membercost  monthlymaintenance
0      0  Tennis Court 1         5.0                 200
1      1  Tennis Court 2         5.0                 200
2      4  Massage Room 1         9.9                3000
3      5  Massage Room 2         9.9                3000
4      6    Squash Court         3.5                  80

Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5.
Try writing the query without using the OR operator.

A4:<br>

><code>SELECT *<br>
>FROM Facilities<br>
>WHERE facid IN (1, 5);</code>

In [26]:
# Using only sqlite3.
cur.execute('SELECT * FROM Facilities WHERE facid IN (1, 5)')
query4 = cur.fetchall()
for fac in query4:
    print(fac)

(1, 'Tennis Court 2', 5, 25, 8000, 200)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)

In [27]:
# Using sqlite3 and pandas.
query4df = pd.read_sql_query('SELECT * FROM Facilities WHERE facid IN (1, 5)', con)
query4df

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,1,Tennis Court 2,5.0,25,8000,200
1,5,Massage Room 2,9.9,80,4000,3000

Q5: Produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100. Return the name and monthly maintenance of the facilities
in question.

A5:<br>

><code>SELECT name, monthlymaintenance,<br>
>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;IIF(monthlymaintenance>100, "expensive", "cheap")<br>
>FROM Facilities;</code>

In [35]:
# Using only sqlite3.
cur.execute('SELECT name, monthlymaintenance, IIF(monthlymaintenance>100, "expensive", "cheap") FROM Facilities')
query5 = cur.fetchall()
for fac in query5:
    print(fac)

('Tennis Court 1', 200, 'expensive')
('Tennis Court 2', 200, 'expensive')
('Badminton Court', 50, 'cheap')
('Table Tennis', 10, 'cheap')
('Massage Room 1', 3000, 'expensive')
('Massage Room 2', 3000, 'expensive')
('Squash Court', 80, 'cheap')
('Snooker Table', 15, 'cheap')
('Pool Table', 15, 'cheap')

In [36]:
# Using sqlite3 and pandas.
query5df = pd.read_sql_query('SELECT name, monthlymaintenance, IIF(monthlymaintenance>100, "expensive", "cheap") FROM Facilities', con)
query5df

,name,monthlymaintenance,"IIF(monthlymaintenance>100, ""expensive"", ""cheap"")"
0,Tennis Court 1,200,expensive
1,Tennis Court 2,200,expensive
2,Badminton Court,50,cheap
3,Table Tennis,10,cheap
4,Massage Room 1,3000,expensive
5,Massage Room 2,3000,expensive
6,Squash Court,80,cheap
7,Snooker Table,15,cheap
8,Pool Table,15,cheap

Q6: You'd like to get the first and last name of the last member(s)
who signed up. Try not to use the LIMIT clause for your solution.

A6:<br>

><code>SELECT firstname, surname FROM Members<br>
>WHERE joindate =<br>
>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(SELECT MAX(joindate) FROM Members);</code>

In [41]:
# Using only sqlite3.
cur.execute('SELECT firstname, surname FROM Members WHERE joindate = (SELECT MAX(joindate) FROM Members)')
query6 = cur.fetchall()
for fac in query6:
    print(fac)

('Darren', 'Smith')

In [42]:
# Using sqlite3 and pandas.
query6df = pd.read_sql_query('SELECT firstname, surname FROM Members WHERE joindate = (SELECT MAX(joindate) FROM Members)', con)
query6df

  firstname surname
0    Darren   Smith

Q7: Produce a list of all members who have used a tennis court.
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name.

In [71]:
# Using only sqlite3.
cur.execute('SELECT Facilities.name, DISTINCT Members.firstname || " " || Members.surname AS full_name FROM Members INNER JOIN Bookings ON Members.memid = Bookings.memid INNER JOIN Facilities ON Facilities.facid = Bookings.facid')
query7 = cur.fetchall()
for fac in query7:
    print(fac)

OperationalError: near "DISTINCT": syntax error